import React, { useState } from 'react';
import '../styles/faq.css';

const FAQ = () => {
  const [openIndex, setOpenIndex] = useState<number | null>(null);

  const faqs = [
    {
      question: "איך אפשר להצטרף ל'אתר השדכן'?",
      answer: "ניתן להצטרף דרך הקישור https://localhost:3000/signup.\n\nלמי שאין גישה ניתן לקבל שירותי מזכירות בתשלום סמלי באמצעות הטלפון. ניתן להתקשר אלינו בין 11:00 ל 14:00 בערב במספר 052-2222222, בימים ראשון עד חמישי."
    },
    {
      question: "אני רוצה להירשם כשדכנית. איך זה עובד?",
      answer: "יישר כוח על הרצון לקחת חלק בנושא החשוב הזה! כאן מפורטים הצעדים הנדרשים לצורך הרשמה למיזם כשדכנים.\n\nלעניין דמי השדכנות, השדכן מגדיר את גובה דמי השידוך שהוא גובה מכל צד, האתר מקבל שליש מדמי השידוך.\n\nחשוב לציין כי אישור שדכנים לוקח זמן היות וחשוב לנו לברר על כל אחד באופן מקצועי."
    },
    {
      question: "למה מבקשים צילום תעודת זהות? מי רואה אותה?",
      answer: "צילום ת.ז נדרש כדי לשמור על הקהילה, כהוראת גדולי ישראל המלווים את המיזם, לוודא שהשימוש במיזם נעשה אך ורק למטרה לשמה הוא נועד.\n\nתעודת הזהות משמשת את ההנהלה לצורך אימות הנתונים. הפרטיות שלכם חשובה לנו, ולכן היא נמחקת כאשר המועמד מאושר."
    },
    {
      question: "האם יש דרך לפתוח כרטיס לשני אחים בלי להכניס את כל הפרטים שוב?",
      answer: "כהורה, לאחר השלמת הרישום של מועמד אחד, ניתן להוסיף מועמד באמצעות לחיצה על הסרגל בצד ימין. לאחר מכן ניתן לסמן 'העתק פרטי משפחה'.\n\nבהצלחה!!"
    },
    {
      question: "כאשר מתקבלת הצעה, האם יש אפשרות לדעת האם זו הצעה של האלגוריתם או התעניינות של הצד השני?",
      answer: "כדי לשמור על מירב הפרטיות של המשתמשים במיזם ולמנוע חוסר נעימות אנחנו חושפים אך ורק את המידע הנדרש לצורך בחינת ההצעה, לכן אנחנו לא מציגים לכם את הפרט הזה."
    },
    {
      question: "קיבלתי הצעה ב'שדכן' שכבר הוצעה לי קודם, התקדמנו, והתארסנו בשעה טובה ומוצלחת, האם עלינו לשלם דמי שדכנות ל'שדכן'?",
      answer: "תקנון האתר נועד למנוע התחכמויות, וכידוע, עם דמי שדכנות לא משחקים.\n\nבפיתוח ובהקמת המיזם הושקעו מאות אלפי שקלים וכל זאת, לרווחת הציבור, ללא תמיכה של גוף ציבורי.\n\nאנחנו סומכים עליכם שתרצו לאפשר למיזם הנפלא הזה להמשיך להתקיים, כדי שנוכל בעזרת השם לעזור לעוד לאלפי מחפשי הזוגיות במגזר, למצוא את זיווגם, בשעה טובה, כמוכם."
    },
    {
      question: "מה גובה דמי השידוך?",
      answer: "גובה דמי השידוך נקבע על ידי השדכן שמנהל את השידוך בפועל והוא נע בין 3,000 ל-10,000 ש"+').\n\nכשהצעה ספציפית מגיעה לשלב מתקדם אחד הצדדים יבחר שדכן באמצעות המערכת ויראה בזמן הבחירה מה גובה דמי השידוך שהוא גובה (וכמה גובים השאר)."'
    },
    {
      question: "אני רוצה להירשם כשדכן אך זה לא מתאפשר היות והגיל שלי פחות מ-30",
      answer: "כדי לשמור על האתר בהתאם לרוח גדולי ישראל, אנחנו כרגע לא מאשרים שדכנים אשר גילם פחות מ-30, אלא רק שדכנים מנוסים ששידוכים זה תחום העיסוק העיקרי שלהם. בתקווה להבנה."
    },
    {
      question: "איך לפתוח את האתר למשתמשי נטפרי?",
      answer: "כדי שיוכלו להתחבר לאתר השדכן צריך להגדיר ג' דברים:\n\nא. להכנס להגדרות סינון > הגדרות כתובות > להכניס את הכתובת של אתר 'השדכן' https://hashadchan.co.il/ בשורה הריקה וללחוץ על הכנס.\n\nב. לעשות כנ"+"ל כדי להכניס את הכתובת של האימות להעתיק כתובת "+" //hashadchan-67cc3.firebaseapp.com/ להכניס בשורה הריקה וללחוץ על הכנס.\n\nג. להכנס ל- תגיות (הגדר תגיות של אתרים שברצונך לסגור או לפתוח וכו') ולכתוב בשורה שכתוב בה 'בחר תגית' - אימות ואבטחת אתרים. ולשמור את ההגדרות בלחצן הירוק (בצד שמאל).\n\nבהצלחה."
    },
  ];

  const handleToggle = (index: number) => {
    if (openIndex === index) {
      setOpenIndex(null); // סגור את השאלה אם היא כבר פתוחה
    } else {
      setOpenIndex(index); // פתח את השאלה
    }
  };

  return (
    <div className="faq-container">
      <h1>שאלות ותשובות</h1>
      <div className="faq-list">
        {faqs.map((faq, index) => (
          <div key={index} className="faq-item">
            <div className="faq-question" onClick={() => handleToggle(index)}>
              <h3>{faq.question}</h3>
              <span className="arrow">{openIndex === index ? '▲' : '▼'}</span>
            </div>
            {openIndex === index && (
              <div className="faq-answer">
                <p>{faq.answer}</p>
              </div>
            )}
          </div>
        ))}
      </div>
    </div>
  );
};

export default FAQ;
